tests/integration/bajaj/test_data/mechanic_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postMechanic>
      <ns1:ObjectList>
        <ns1:MechanicData>
          <ns1:MechanicModel>
            <ns1:MECH_ID>123444555</ns1:MECH_ID>
            <ns1:TEMP_MECH_ID>TME3YEGNK</ns1:TEMP_MECH_ID>
          </ns1:MechanicModel>
        </ns1:MechanicData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajajcv</ns1:UserName>
        <ns1:Password>bajajcv</ns1:Password>
      </ns1:Credential>
    </ns1:postMechanic>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>